[
    [
        {
            "title": "AITA Monthly Open Forum June 2024: Assholes ASSemble!",
            "selftext": "#Keep things civil. Rules still apply.\n\nWe’ve been diving into various sub rules lately. So we thought we’d take a break this month, and revisit something we did in an earlier open forum. Hence, the call to ASSemble! (We had a few names that we were throwing around. ASS (Assholes Sharing Stories), Asshole Amnesty Month.\n\nTell us about a time when you were the asshole. We can relax *some* sub rules a bit (a revenge story is probably fine, since you’re recalling, and not asking for judgment). But, other sub rules still apply (no violent encounters, for example)! Let us know about a time when you knew you were the asshole. Maybe you didn’t mean to be, but after the encounter, you realized you were TA. Or, maybe you knew what you were doing, and went through with it anyway! \n\nPersonally, I've always felt the more low-stakes the issue, the better. Those are always my favorite AITA stories, but feel free to share whatever you may have. And most important - have fun with it! \n\n___\n\n#As always, do not directly link to posts/comments or post uncensored screenshots here. Any comments with links will be removed.\n\n---\n\nWe'd like to highlight the regional spinoffs we have linked on the sidebar! If you have any suggestions or additions to this, please let us know in the comments.",
            "ups": 66,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1d5g8i7/aita_monthly_open_forum_june_2024_assholes/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1d5g8i7/aita_monthly_open_forum_june_2024_assholes/",
            "author_fullname": "t2_2yspbtwq"
        },
        {
            "title": "AITA for walking out the room after my brother told me the name of his baby?",
            "selftext": "\nI am only a teenager but my mother had my brother at 16 making him in his 30’s. Ever since i was young I have always talked about naming my future daughter Scarlett, I don’t know why but I have always adored the name. Every time the topic of babies, names, and children comes up I always say that my daughter will be called Scarlett, everyone in my family knows this. Last week, my sister law gave birthday to a healthy baby girl, as you can probably guess, they named Scarlett. I was really upset at my brother as he knows that was my top name, I didn’t make a big deal about it I just left the room obviously upset, Scarlett isn’t a family name or anything and my brother has never mentioned liking the name, one time he said he wasn’t a fan. I asked him why he would name his daughter that and he told me to stop over reacting and get over it and that i don’t own the name. I get that It doesn’t belong to me but just because I am a teenager doesn’t mean\nthat I am not allowed to have plans for my future.\n\nEDIT: when i say walked out I didnt like storm out or anything i just excused myself. A lot of people are saying that its common for cousins to have to same name but not here and in my family. And. Scarlett isnt a common name here ❤️❤️\n\nSome people are confused, im a girl. And im not sixteen 😂❤️",
            "ups": 1728,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1df8rs0/aita_for_walking_out_the_room_after_my_brother/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1df8rs0/aita_for_walking_out_the_room_after_my_brother/",
            "author_fullname": "t2_12f870ip7y"
        },
        {
            "title": "AITA for not retaking the family photo since my DIL was not in it",
            "selftext": "Every couple of years we get everyone together and do family a giant family photo. In total it is about 40 people. \n\nOur last one was in 2018 and we decided to do this again. I organize the whole thing and everyone was told that small pictures will be done at 4 and the big picture was at five. Afterwards we get dinner.\n\nThe issue is that my son and DIL were running late. Wasn't a big deal since it was just small pictures. They get here in time for the large picture. I asked everyone to be there on time. I called twice asking if anyone is missing. Everyone is lined up and the photographer takes like 15 minutes of the big picture.\n\nEveryone is hungry and hurrying to get food. My DIL soon comes out asking about the picture. It is around 5:30 at this point. She told me that she was in the bathroom fixing her hair when the picture was being taken. She asked me to round everyone up again to get a picture\n\n\nI told her no, that she was late coming to the event and couldn't care enough to actually be on time for the picture. I am not gathering everyone up again and paying the photographer an extra hour ( he was done and packing up at this point)\n\nThis caused a huge argument between her and me. My son is demanding I get her in the picture and I told him to pay someone to photoshop her in\n\nAITA?",
            "ups": 1558,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1df7xke/aita_for_not_retaking_the_family_photo_since_my/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1df7xke/aita_for_not_retaking_the_family_photo_since_my/",
            "author_fullname": "t2_12f639c5kx"
        },
        {
            "title": "AITA for not inviting my picky eater Dil to my dinner event",
            "selftext": "I will be as clear as possible. I like to try new food and there is a chief I have been following for years. She open a restaurant near me a few years ago and it is almost impossible to get a spot. I was extremely lucky and got one. It is a fixed menu and you eat what you are served for the most part. The menu changes or rotates about every week.\nThey serve unique dishes.\n\nAnyways when I booked it I booked for only five people. I invited my sisters, my two daughters and me. I also decided to pay for it all since I have a good job and wanted to treat them. \n\nThis is we're the issue started, I have a DIL who is a picky eater. I didn't include her in the invites because I know she wouldn't eat it. I can't even be certain she would try dishes. She is the type of person that eat like 5 foods.\n\nEveryone runs in the same-ish  circle and I got a call asking  why she was not invited since she knows everyone that was invited. I tried to be polite by saying it was just a small gathering and move the conversation along.\n\nShe kept pushing and I told her it is because she is a picky eater. That I am not paying for someone to not like the food, or not even try it. She thinks I am very cruel for excluding her.",
            "ups": 2014,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1df476w/aita_for_not_inviting_my_picky_eater_dil_to_my/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1df476w/aita_for_not_inviting_my_picky_eater_dil_to_my/",
            "author_fullname": "t2_12ew1jes0a"
        },
        {
            "title": "AITA for telling my wife to please get the hell out of my way. ",
            "selftext": "I was raised to always be helpful and polite. I like to hold the door open for people, as an example. \n\nI always try to treat my wife with respect. She is a good person but even if she weren't I would. \n\nShe has been trying to be like me lately. And it's driving me nuts. \n\nShe cannot understand the Time Cop rule that two bits of matter cannot occupy the same space. \n\nShe will hold the door for me then stand in the way. When I hold the door for her I stand to the side so she can pass. She cannot seem to get this concept. \n\nI have had to start traveling for work and she drives me to the airport. I could Uber but she says she likes the drive. We always stop for breakfast on the way so it's a way for us to sneak in one more date before I'm gone for a while. \n\nSo I will have my backpack on and my rolling luggage in my hand. She will open the door go through and hold the storm door. But she will fully stand in the way.  \n\nI have explained the concept of standing to the side. I've asked her to please just go through and I will deal. I've tried leaving before her so I can deal. I've even tried just standing inches away as she holds the door and I cannot move forward. Nothing works. \n\nI was in a hurry yesterday because my flight was changed. We could still stop for breakfast but we didn't have much leeway. \n\nAnd she would not get out of the way. I lost my coolmand asked her to please get the hell out of the way because I needed to get to the car. \n\nShe is mad at me and has brought up my rudeness at both our calls since she dropped me off. \n\nI think that I have been very patient and she should have taken the hint before now. ",
            "ups": 3830,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1deyapp/aita_for_telling_my_wife_to_please_get_the_hell/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1deyapp/aita_for_telling_my_wife_to_please_get_the_hell/",
            "author_fullname": "t2_12egg4nqyp"
        },
        {
            "title": "AITA for telling my wife that I do not want to go to her parents house on Father’s Day?",
            "selftext": "Need to know if I am wrong. My wife asked me what I wanted to do for Father’s Day. I said take it easy, chill at home and hang out with the kids. She said ok but her sister asked her if we all wanted to get together to do a Father’s Day cook out for me and my father in law. This would mean me, my wife and two kids would go to her parents house for dinner/cookout along with my sister in law and her husband. I told her I don’t know that I just want to take it easy at the house. I then told her that she could go and I would just hang out with the kids. She said ok but then said the kids also should go to see her dad. I said really? Thinking to my self I get that she wants/needs to see her dad but why couldn’t the kids stay with me. Am I wrong for just wanting to hang out at home and with my kids on Father’s Day and not go to the in laws and keep the kids with me while my wife goes for a bit? ",
            "ups": 398,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dfbea1/aita_for_telling_my_wife_that_i_do_not_want_to_go/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1dfbea1/aita_for_telling_my_wife_that_i_do_not_want_to_go/",
            "author_fullname": "t2_xnll7"
        },
        {
            "title": "AITA for walking away from my pregnant wife on the beach?",
            "selftext": "So we parked the car at the beach which is about 100 metres away from the sea and started walking up. My wife is almost 7 months pregnant and is quite a slow walker. I pulled ahead about 15-20 metres to get a lay of the land and to see how busy it was etc. My wife claims when I pulled ahead I didn't turn back to check she hadn't fallen over once. \n\nI was not that far ahead, and I easily could have heard her if anything had happened. I think she is being unreasonable because it doesn't seem like a big deal. We have a very good relationship, we rarely fight but this seems to have really got under her skin.\n\nAITA? \n\nEdit: we're on holiday in a foreign country and it's significantly hotter than a temperature we're used to. I'm also 6ft4 and she's 5ft 1",
            "ups": 2719,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1devv9y/aita_for_walking_away_from_my_pregnant_wife_on/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1devv9y/aita_for_walking_away_from_my_pregnant_wife_on/",
            "author_fullname": "t2_5z1k93tb"
        },
        {
            "title": "AITA for calling the police on my GFS daughter?",
            "selftext": "So I'm 42 gf is 50 and she has a 25 year old daughter that has a key to our house. Her daughter likes to take things from our house without permission, stealing as everyone else calls it. Mainly it's been tools from my tool box, new Tupperware we had just bought, she said hers was old and stained so she threw hers out and took ours without asking or telling us. Recently we bought a nice computer desk and noticed a beat up flimsy one in it's place about 2 months later. Her daughter said she replaced it with her old one because ours was better than hers. GF refuses to put her in her place because when she does the daughter threatens to not let my gf see her grandson. Clearly the daughter is escalating in what she steals and my concern is how long before my Metallica autographs walk out the door with my guns and guitars.  In my frustration I put up a camera in secret and caught her taking items from the garage and house. I went to the police and showed them the footage, we went to her apartment, I confronted her and gave her two choices; return the items or I press charges. She returned them and now is telling her mom to leave me. AITA?  ",
            "ups": 1352,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dexv0i/aita_for_calling_the_police_on_my_gfs_daughter/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1dexv0i/aita_for_calling_the_police_on_my_gfs_daughter/",
            "author_fullname": "t2_joa65z23"
        },
        {
            "title": "AITA for giving my sister a wedding cake made by one of my assistants instead of making her one myself. ",
            "selftext": "My grandmother made wedding cakes for everyone I knew growing up. I learned how to do everything from her. I would make roses out of playdough while she made them from fondant. My sister was never interested. I have turned my memories of my grandmother into a business. \n\nI make wedding cakes. And I charge a fair bit for them. As an example my base price is $8 a slice. So if you have 100 guests you will be buying an $800 cake. One of my base models. In return you will get a delicious cake with piped decorations. \n\nAt $17.50 a slice you get my top notch work. Hand molded flowers and the whole deal. Yes I know it is expensive. Nobody is forced to buy one of my cakes. There are many very good bakers in my city. \n\nMy sister is getting married. It is kind of a last minute thing. She came with my mom to talk to me about making her wedding cake like two weeks ago. Very last minute. I said there was no way as I had other clients that were ahead of her. My mom got mean and said that I had to do this. After a while I relented. I love my sister even though she is an impulsive pain in the ass. \n\nI said I could do it for about $1,000 for what she wanted. That is much less than I would charge anyone else. There is no profit in that at all. She wanted a very elaborate cake with a lot of decoration. \n\nOH HELL NO IT'S GOING TO BE A GIFT. \n\nI do not give gifts that expensive. I am not rich. I will have to eat the material costs and the wages for my helpers as is. \n\nI did not want to argue any more so I said that I would make her a basic cake. Still very nice. I did not budge. I do not negotiate about losing money. \n\nI actually though about outsourcing to a really great Filipino baker I know that could do it cheap. It would cost me $300 and I could concentrate on my clients. \n\nI ended up just letting one of my apprentices do the cake. It was for my sister so I double checked everything. And I did the decorations on the top tier. The one the couple saves to have on their anniversary. \n\nThe cake was a hit and many pictures were taken. I told them NOT to mention that I did the cake. It was not really up to par. They did not listen. I had a client that knew my sister. She asked and I was honest. My sister found out she got a cake make by my helper. It has caused a huge fight. \n\nI think it would have been better if they had just gone elsewhere. They are pissed that I did not spend days sculpting the cake just for them. \n\nAITA?",
            "ups": 3999,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1deqop3/aita_for_giving_my_sister_a_wedding_cake_made_by/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1deqop3/aita_for_giving_my_sister_a_wedding_cake_made_by/",
            "author_fullname": "t2_12dd19witc"
        },
        {
            "title": "AITA… for not splitting my friend’s train tickets home after getting different flights due to missing our original flights home?",
            "selftext": "AITA… for not splitting my friend’s train tickets home after getting different flights due to missing our original flights home?\n\nContext - all 26F. We have just been on holiday and missed our flight home due to oversleeping. We woke up and I was panicking as I had work the next day so was looking at flights. I had originally found a cheaper option which would mean us getting a cheap coach to another airport meaning that we get the cheaper flight to a different city in our country, and that my partner would pick us up and drop us home. \n\nThey didn’t want to get the coach even though it would’ve worked out cheaper for all of us, so I had to make a decision and found one seat on a direct flight home which would get me in earlier. This was okayed by two of them but one of my other friends said it was selfish. I booked the flight and then helped them find an alternative flight for the three of them. Splitting any of the costs wasn’t discussed or agreed at this point. \n\nI left for the airport and then got a message from one of them asking if I would be cool to split the costs of all the flights together. At first I wasn’t sure but had a think about it and decided it was fair as they got more expensive flights. My flight was delayed by 9 hours and they ultimately got home before me. They had to fly to a different city and get train tickets home for a 3 hour train. \n\nThe next day I sent over the calculations of what I would have to send each of them but they weren’t happy as I hadn’t included their train tickets, but they would’ve had to buy transport home regardless of if we made our original flight (albeit the new train tickets they bought were more expensive). This wasn’t a cost agreed and now there is back and forth about what I should pay as they spent more on getting home. \n\nI didn’t choose the earlier flight due to cost, just to get home for my responsibilities as I had work the next day whilst they had an extra day off. Now I feel villainised for doing so, although they were okay with it at the time of me booking my flight. I feel like I’ve been more than fair in splitting the flights but the train was a surprise cost put on me. Before the holiday I hosted them the night before and my partner gave us a lift to the airport which saved us about £50-£60 in airport transfers and he also paid for the drop off cost. \n\nAm I the asshole for disagreeing with this? I struggle to set boundaries sometimes and feel a bit bullied into this. I feel like they have fallen out with me over this, which seems pointless as we have had a lovely holiday. Has anyone got any advice with this? I want to say no but I am struggling with advocating for myself here. ",
            "ups": 406,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1df2v86/aita_for_not_splitting_my_friends_train_tickets/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1df2v86/aita_for_not_splitting_my_friends_train_tickets/",
            "author_fullname": "t2_cq2ii9p7"
        },
        {
            "title": "AITA for yelling at my sister after she leaked private videos of my room???",
            "selftext": "I (19F) live with my parents, my younger sister (16F), and our four dogs. Recently my sister sent private videos of my room that she took when I was at my lowest point mentally to her friend. This friend then sent the videos to all of our friends. For everyone we knew to see. My boyfriend (22M), and several of our friends saw it before they finally took it down because my mother told them to. My sister’s friend said he did it because I “needed to learn my place”, and that “no one was going to give me any sympathy” because I “didn’t deserve it”. I screamed at my sister and her friend, and called them out for invading my privacy, and humiliating me purposely. I blocked my sister’s friend and unadded them on everything. I still haven’t really talked to my sister. My mother then said that I had done it to myself and I should have kept it clean, though she knows that I was not at all mentally stable/well at the time those videos were taken.  AITA?",
            "ups": 489,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1df0myb/aita_for_yelling_at_my_sister_after_she_leaked/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1df0myb/aita_for_yelling_at_my_sister_after_she_leaked/",
            "author_fullname": "t2_119njezway"
        },
        {
            "title": "AITA for telling my SIL to stop treating me like a kid?",
            "selftext": "Ok, so I, 19M, have an older brother 25M, Olly, who is married to Molly, 28F, they married when I was 16, and everytime Molly comes over when I am present she goes out of her way to baby me even more than my parents do. She calls me Olly's 'cute little baby brother', pinches my cheeks, and gives me sucky lollipops, like the ones you get from Sainsbury's, and always asks me to eat them in front of her, even though they're kinda gross. \n\nI'm 19 fucking years old and she's acting like some old auntie with a child. I feel bad, because she's a really nice person and she does probably see me as a little brother of some kind since she's always getting me stuff and giving me compliments, telling me how much I look like Olly. \n\nThis all came to a head earlier today, when Molly gave me one of those suckers, and I said thank you and put it in my pocket. She told me she wanted to see me have it, as I was a 'growing boy' and she was worried about me. This is where I may have been TA, because I snapped at her that I wasn't a 'growing boy', I was grown fucking adult and I'd appreciate it if she stopped treating me like a kid.\n\nShe got really upset, and told me she didn't expect me to be so rude and impolite.  She went back over to Olly, and I went back to my room and I'm feeling really guilty now. I didn't mean to upset her, but I just don't want to be treated like a bloody toddler anymore.",
            "ups": 497,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dezp8e/aita_for_telling_my_sil_to_stop_treating_me_like/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1dezp8e/aita_for_telling_my_sil_to_stop_treating_me_like/",
            "author_fullname": "t2_12ehmczbcb"
        },
        {
            "title": "AITAH For Flying a Flag?",
            "selftext": "I (24F) am a Finnish-American who loves both countries. I recently moved to a neighborhood with a lot of older gentlemen. My new house has a flagpole with 2 flying flag hooks, and I  saw this as a great opportunity to appreciate my home and my new country. So I put an American Flag on the top hook (because flag code says the American flag should be higher than other flags) and a Finland Flag below it. Today my neighbor (88M and his friend 87M) came and knocked on my door and asked me to take my Finnish flag down. When I asked why, they said (and I quote) “Flyin’ two flags is a real illegal thing to do. We fought in ‘Nam to give the ‘Merican flag the right to fly, not a communist country” They meant “illegal” as in immigrant, which I am, but I have papers and came legally. (Also Finland is not communist). They came back a second time after I respectfully asked them to leave and they had a lockcutter looking contraption and threatened to cut my Finland flag down. I feel a bit bad that I’m making them this upset. They said my flag is triggering their PTSD (I have no ideas how, as Finland was on America’s side through Vietnam). Am I the AH? ",
            "ups": 123,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1df9uec/aitah_for_flying_a_flag/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1df9uec/aitah_for_flying_a_flag/",
            "author_fullname": "t2_127hi26gqp"
        },
        {
            "title": "AITA for not giving my neighbors soccer ball back, after he threw it onto my 3rd floor apartment balcony, which he kicks against the side of the apartment all day?",
            "selftext": "A little context. I live on the 3rd floor of an apartment building and the family below me has a little boy who loves to kick his soccer ball around ALL DAY. He kicks it against the side of the building, against the inside walls of his apartment, slams it into the ceiling (my floor), and throws it onto the roof. This isn't just loud; it shakes my entire apartment. I work a night shift, and this makes it impossible for me to sleep. \n\nBy chance, he kicked his soccer ball onto my balcony, and I just haven't given it back. It's been two days, and he has been knocking on my door continuously for those two days. He knocked (beat) on my door for two hours straight today, and at least once every hour after that. The thing is, I can sleep through someone knocking on my door, I can't sleep through my apartment shaking. I was finally able to sleep a full 8 hours today and I really don't want that to go away. AITA?",
            "ups": 2293,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1deqq0u/aita_for_not_giving_my_neighbors_soccer_ball_back/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1deqq0u/aita_for_not_giving_my_neighbors_soccer_ball_back/",
            "author_fullname": "t2_nb46k2clp"
        },
        {
            "title": "AITA for how I reacted to my wedding pictures?",
            "selftext": "I got married (22f) to my husband (24m) a few weeks ago. The wedding overall went great even though there were a few minor hiccups. We hired a professional photographer who stated in his contract that we couldn't hire another photographer besides him. If we wanted a second photographer, we had to hire one of his assistants or coworkers. This is pretty typical in the wedding industry.\n\nMy aunt surprised us at the wedding by doing photography as a gift to us. This was very surprising and she didn't tell anyone besides her husband. She's a real estate photographer, so she has a fancy camera and occasionally takes pictures of people. Our photographer was PISSED. He pulled me aside and asked what was going on and I had to explain the whole situation, which made me extremely stressed. While taking pictures, my aunt would pull people aside when they needed to be with the professional photographer for group photos. It turned into a chaotic mess, but we wanted to be kind and were SO stressed and had no time to tell her to stop.\n\nWe got the photos back from her last night. The photos of me were rough. They're taken from a low angle so I have a double chin, my mouth is open in 1/3 of the shots (talking, eating, etc). There's zoom ins of my face and my eyes are closed. They're pretty much all candid's. You can see how stressed out I am in my facial expressions, because behind the scenes the real photographer was shouting at us to hurry up.\n\nIn comparison, the photos of my friends taken by her were all staged by her and look gorgeous. People are smiling , posed, and beautiful. I began sobbing seeing them. I showed the photos to a few of my friends and they very kindly told me that they were unflattering pictures of me.\n\nMy family received the photos and plans on putting them up in their house because they're from my aunt. I asked them to wait because we will have professional photos soon, but they don't want to wait for those. I'm insecure about my appearance and I've been sent photos of me squinting or with my eyes closed with a double chin calling me beautiful and I just know that's not the case based on my non family member's reactions.\n\nMy husband said these features are normal in humans and that he didn't like his hair in the pictures and to just get used to it. I cried off and on when looking at them and told him it was different because he's smiling, his eyes are open in the photos. He got angry and said the point of a wedding is to celebrate our love and that the photos don't matter. He told me to just stop looking at them if it's going to make me cry and I just didn't say anything after that.  I wish he was more empathetic, but he thinks I'm being self centered and remained upset at me for crying for the rest of the night.\n\n  \nEdit: We had already started taking professional photos when she showed up and began grabbing people for pictures. We didn't fully realize what was going on until she began grabbing people away. We thought she was just taking photos of her own kids. After she began taking pictures of everyone and grabbing people, she told us it was our gift and the photographer asked what was up and we told him and he saw how upset we were so he didn't' leave. We had 30 minutes until the ceremony and we didn't want to start an argument with her when we were stressed enough.\n\n\n\nAITA",
            "ups": 163,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1df6926/aita_for_how_i_reacted_to_my_wedding_pictures/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1df6926/aita_for_how_i_reacted_to_my_wedding_pictures/",
            "author_fullname": "t2_6axzflgz6"
        },
        {
            "title": "AITA for calling the police because my neighbors were being loud?",
            "selftext": "I live in an apartment complex with about ten 10-12 story buildings. I live on the third floor. \n\nThree days ago, drunk men were really loud outside of my building. They were singing and yelling. It was almost 2 am.\n\nI am 21 years old, work full time, and study full time. It's exam season currently, so I was really irritated that they woke me up, and I was also irritated that they weren’t shutting up.\n\nI could hear my other neighbors asking them to keep quiet, but they weren't shutting up, so I called the police. \n\nThe police came, and I guess things escalated because they arrested one man.\n\nThe next day, I could see Facebook posts in the neighborhood group, and surprisingly, the rude and mad comments were directed at a person who had called the police (me lol).\n\nI figured out that it was someone’s birthday.\n\njust so you have a better understanding, I’m translating one post from that group: \n\n“when the dogs are barking and howling all night long, you don’t seem to be bothered and you are mad over sounds of fun and happiness? people are so unfair, May God bless you with many loud birthdays George!”\n\n\nToday, a woman came to my door, visibly upset (I could see her through the peephole). I didn’t open the door. She somehow figured out who called the police, and I figured she's the wife of the man who got arrested. She was calling me names and saying that I wouldn’t be at home forever, and I'll get my share of fairness. Kinda sounds like a threat if you ask me.\n\nAm I the asshole for calling the police?\n\nShould I apologize?\n\n\np.s. \nsorry for my english, it’s not my first language.\n\n",
            "ups": 550,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dewj0f/aita_for_calling_the_police_because_my_neighbors/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1dewj0f/aita_for_calling_the_police_because_my_neighbors/",
            "author_fullname": "t2_11x9fyywq4"
        },
        {
            "title": "AITA for following through with my late wife’s wishes?",
            "selftext": "I (49M) was married to my wife for 20 years. I lost her in a car accident 8 years ago. We had two beautiful daughters together, Maeve (18 now, 10 when her mother passed) and Alex (16 now, 8 when her mother passed). \n\nI am very close with my daughters but they were both definitely mama’s girls. My wife was a magnetic woman. She was beautiful, intelligent, kind, and people were drawn to her. \n\nAn important thing to know about my wife is that she had a passion for writing. She was unfortunately in a profession where she didn’t write much so, she did a lot on her own time. One of her favorite things to write was letters. She wanted people to know that she cared about them. \n\nAfter she had each of my daughters, she wrote them a letter. She wrote each within days after their births and wanted to give them away on their graduation days. She put them in the fire box in our basement to avoid losing or forgetting about them. She wrote the letters with the intention of giving them to our daughters herself 18 years later as a sort of time capsule type of thing. Both letters contained mostly words of wisdom and information about what was going on when they were born. \n\nMaeve graduated from high school today and I went to her room with the letter tonight. I let her cry on my shoulder as she read it and at first she seemed happy to have her something directly from her mother. However after she read it she turned to me looking surprisingly angry. She asked why I had waited so long to give it to her. She had so many rough moments and heartbreak in the last 8 years where all she wanted was her mother’s wisdom and I withheld the letter. \n\nI told her that I was just doing what her mother had said she wanted and Maeve shot back that her mother also hadn’t planned on being in the accident. Alex heard the shouting and came into the room and Maeve told her about the letter. \n\nNow they’re both upset and don’t want to talk to me. I feel so awful about this whole situation. I was raised by my single mother after my own dad took off so on one hand, I’ve always wanted to be the best father I can and I feel terrible that I withheld something that would’ve brought them comfort. On the other hand, my wife had very specific instructions about her intentions with the letters and I just wanted to follow through with that. So now I’m very conflicted and I just want to know, AITA?",
            "ups": 10500,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1degchk/aita_for_following_through_with_my_late_wifes/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1degchk/aita_for_following_through_with_my_late_wifes/",
            "author_fullname": "t2_x3iucudl6"
        },
        {
            "title": "WIBTA if I name my own baby?",
            "selftext": "I,(22 F) am currently 9 months pregnant with my first child. My mother (42 F) has been extremely supportive throughout my pregnancy in terms of buying the baby stuff and making sure we are ready for once the baby arrives. The father of my child (25 M) hasn't been there as much as I would have appreciated him to be and when I voiced this out he broke up with me after a 3 year relationship, however he and I are on good terms currently as friends and I have no intention of getting back with him. His mother (54 F) and I were once close then stopped being close because her two daughters don't like me, one felt I was \"replacing her\" and the other chose to side with her sister which is the right decision, the older sister asked to speak to me but I believe had there not been a baby there would not be a conversation so the distance between us works just fine to maintain the peace we both have.\n\n The male's mother has also been supportive for the last few months although she has made some comments that I don't like such as \"she doesn't look a month pregnant\" after her son told her in a family meeting he had with his mother and sisters (might I add I am a university student so the relationship is long distance) other comments have been on how I dress. \n\nI am writing all this so you understand everyone's place in my life my ex wants to give the baby a name, his mother wants to give the baby a name and my mother wants to give the baby a name. I don't like all names I have resulted in standing back and alllowing myself to not giving my child a name because at first I felt I will write all names chosen on the birth certificate. \n\nRecently there's been a problem of what will the baby's first name be. I am thinking of naming my child something completely different and sticking to it. WIBTA?",
            "ups": 307,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dezeds/wibta_if_i_name_my_own_baby/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1dezeds/wibta_if_i_name_my_own_baby/",
            "author_fullname": "t2_qcc6b6e5d"
        },
        {
            "title": "AITA for telling my dad, if he wants me to get married, and have kids then he can pay for it?",
            "selftext": "I (26m), single, live in a small mobile home community. I've been told numerous times by my dad to get a gf, marry, and have kids. Me personally dont really want any of that as i will never be able to afford. I've lied to my dad saying that i 'might'. After a few times of saying i 'might', he told me that i need to do this for the family name, i finially snapped and told him that \"If this is so damn important to him you then you pull your checkbook out a pay for it.\" That pissed him off, until i rubbed it in further and said, \"I dont give an f about our family name, we're not rich millionaires, i can barely afford to get a gf in the first place.\" I finally told him that i'd rather go out with friends, find new hobbies, work hard on my career, and in the future, travel places i dream of going to. So AITA for not doing what my father wants?",
            "ups": 89,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1df8tzw/aita_for_telling_my_dad_if_he_wants_me_to_get/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1df8tzw/aita_for_telling_my_dad_if_he_wants_me_to_get/",
            "author_fullname": "t2_pgo771bq"
        },
        {
            "title": "AITA for refusing to accept my mom’s friend’s MacBook after her autistic son broke mine and asking her to buy me a new one?",
            "selftext": "I (16F) got a brand new MacBook Pro for my birthday last month. My family isn’t rich and I don’t usually get gifts like that. My parents said they got me that because I’ve been doing great at school and they thought I deserved something nice after using an old Chromebook for years. \n\nA few days ago, my mom’s friend came over with her kids (14F and 10M). We were in my room and me and the girl were sitting on my bed talking while the boy was on the floor playing with some Legos (he is autistic). He walked over to my desk, opened my laptop, and told me to give him the password so he could play Roblox. I told him he can’t play on my computer and he started crying and saying it’s not fair and he’s bored. I told him to go get his mom’s phone if he’s bored and he said he wants to play on my laptop. When I said no again, he threw it on the floor and stomped on it.\n\nI went outside and told my mom. His mom apologized and said she would pay for the repairs. I told her that I don’t think it’s repairable because it’s completely smashed. He threw it open with the screen facing down. The thing that connects the screen to the keyboard snapped, the screen was filled with cracks, and it was dented all over. We took it to a repair shop and they told us that it can’t be fixed and we should just buy a new one instead.\n\nMy mom called her friend and told her that. She came over with her MacBook and said I could have that instead. I told her that I don’t want her 5 year old MacBook Air, I want her to give me $1800. My mom is on my side and she is going to give us the money, but she’s not happy about it. She said she was planning to buy her daughter a laptop because she’s going to high school and her son a PS5 for his birthday and she won’t be able to do that because I was greedy. I don’t care that her brat isn’t getting a PS5 but I kinda feel bad for her daughter because this wasn’t her fault. She’s been telling all of her and my mom’s other friends that I’m a spoiled brat and this wouldn’t  have happened if I’d let her precious baby boy play Roblox or given him my phone. He also didn’t really understand what he’s doing because he’s autistic.",
            "ups": 44,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dfcvs2/aita_for_refusing_to_accept_my_moms_friends/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1dfcvs2/aita_for_refusing_to_accept_my_moms_friends/",
            "author_fullname": "t2_12898co3kx"
        },
        {
            "title": "AITA for giving a white child a trip to camp in my mainly Indigenous organization? ",
            "selftext": "I (27f) am a social worker at a homeless shelter. Our shelter serves mostly Indigenous families but our doors are open to everyone. I am the case manager for the children’s files. \n\nI recently applied for a partnership with a children’s museum in our town where we could send our children in the shelter to their summer camp for free, and we were approved. Problem was we were given only one scholarship for the camp, and we had five children who qualified. I had applied under the impression we could send more than one. My clients who qualified were two sets of brothers, both sets indigenous, and one only child, who is Caucasian. I felt the most fair option was to give the only child the scholarship because I didn’t feel it would be fair to give one brother a scholarship and not the others. I ran this past my colleagues who were on shift at the time and they agreed. The child who got the scholarship was absolutely thrilled. I’m currently looking for other opportunities for the other kids and have gotten them several day passes to different rec centers (ie trampoline park, zoo. Etc). \n\nThis was three days ago and we’ve since had another rotation of staff come on and they are FURIOUS with me over the child I chose for the scholarship. I am being called racist and that I am making our Indigenous agency look bad for favouring the white child. One colleague is trying to call the museum to get the scholarship transferred. \n\nNowhere in the application, nor our guidelines, say we need to give Indigenous children priority. I genuinely was not thinking about race, I was thinking about what would cause less conflict. I did not want to have to choose between siblings, so I chose a child who didn’t have one. \n\nAITA? \n\n*edited to add because it’s probably important to mention, the other kids will be going to camp too- we have multiple opportunities and partnerships but this one specifically we only got one spot*",
            "ups": 51,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dfayhx/aita_for_giving_a_white_child_a_trip_to_camp_in/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1dfayhx/aita_for_giving_a_white_child_a_trip_to_camp_in/",
            "author_fullname": "t2_ufbrmf5z"
        },
        {
            "title": "WIBTA for reporting my friend’s family business?",
            "selftext": "My friend comes from a relatively affluent family, his parents operate a small business that’s very successful. I don’t know their numbers, but it’s enough to fund a $2 million house and giving their son a $3,000/month allowance + $90,000 sports car. \n\nI never really knew how their business worked or how they were able to afford such luxurious lifestyle despite being in a very competitive and low margin industry. Well my friend spilled the beans and it’s tax evasion + breaking labour laws. They don’t report majority of their cash transactions and keep the sales tax they hold and they also exclusively hire undocumented immigrants who have little to no leverage. Minimum wage in our area is $15/hour, they’re paying their workers $7/hour. They also don’t get overtime pay or benefits. \n\nIt just rubs me the wrong way that his family was literally living such an excessive and wasteful life style while they exploited immigrants and pay less tax than me. \n\nI’m thinking about recording our next conversation and hopefully getting his dad caught red handed as well and sending it to the tax and labour department. \n",
            "ups": 136,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1df3nrm/wibta_for_reporting_my_friends_family_business/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1df3nrm/wibta_for_reporting_my_friends_family_business/",
            "author_fullname": "t2_12eudczc4r"
        },
        {
            "title": "AITA for changing my passwords  so my sister can't use any of the apps for work? ",
            "selftext": "I (30 F) have a sister (29) that has been a spoiled child since she was born. Not only my parents, but everybody would overprotect and give her anything she demanded,  claiming that she was the sweetest. On the other hand, i've always been rebellious and independent. This resulted in me working since i was 16, and currently owning my own successful business, while she has not worked a day in her life until a few months ago.\n\nSince i make a pretty good amount of money, i shower them both, my mom and my sister, with gifts everytime i can. Cellphones, brand clothing... anything, and it is never the other way around.\n\nI decided not to help my mom with anymore money until my sister  began to do the same, because she's been avoiding that responsibility saying she is depressed or anxious.  \n\nShe recently got a job as a personal assistant, where she required  to know some stuff to get the job done. She also needed a computer and she needed some specific apps. \n\nI pay a monthly fee for those apps, so i shared my password with her, taought her how to use them, and lend her some money to get a laptop. I've been helping with anything she needs.\n\nBut today, she decided to go back to her old self. Demanding help and miss treating me afterwards. I decided to give back the same attitude and we ended up having a big fight. I decided to change my passwords, not allowing her to work anymore on what she was doing. I know she can't afford them, and now i have her, my mother and a couple of relatives calling me the ah. They are demanding me to apologize and give the new passwords.\n\nI'm so done with her being a 29yo spoiled kid. If itah, then so be it.\n",
            "ups": 57,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dfaiw7/aita_for_changing_my_passwords_so_my_sister_cant/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1dfaiw7/aita_for_changing_my_passwords_so_my_sister_cant/",
            "author_fullname": "t2_11qcwce9ls"
        },
        {
            "title": "AITA for leaving my friends house after she made me wait me outside for 20 minutes?",
            "selftext": "Me and my friends usually do get togethers at my friends house since she is the one with the nicest patio/backyard. Two weeks ago we arranged our usual get together and planned on playing board games (nothing too crazy), she told us to come at 7 but since I do not drive and depend on my mom to take me everywhere I was a little late (15min aprox) and forgot to let her know, when I got there I sent her a message letting her know I was there to which she replied \"give me 10 min\", nothing weird since she has done that before when she's not ready yet. After 15 min aprox I texted her again asking if she could open the door since it was getting windy to which she replies \"No, you made me wait 15 minutes so now I'll make you wait 20\" I was PERPLEXED, she had never ever done anything like this before and mind you in our culture it's pretty common to arrive a little bit later that the accorded hour (15-20min), by the time she opened the door my other friend was already there waiting for her and she did not make her wait outside like she did with me, I said jokingly since that is how we talk to each other \"How unpunctual\" to which she replied \"Tone it down, Im not in the mood\" this was the final straw for me so I told her I was leaving, took an uber home and have not talked to her since, so am I the asshole for leaving and getting mad?\n\nUPDATE \nThank you everyone! Me and my friend talked in person about this whole situation, while she seemed mad about my behaviour she also accepted that she was in the wrong and definitely not in the mood that evening, I also apologized for being late and promised to do better since I know it can be frustrating for others. Hopefully this never happens again! ",
            "ups": 1116,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1deqyg3/aita_for_leaving_my_friends_house_after_she_made/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1deqyg3/aita_for_leaving_my_friends_house_after_she_made/",
            "author_fullname": "t2_knxzguone"
        },
        {
            "title": "AITA for refusing buy birthday presents for my SIL's dog?",
            "selftext": "I (35M) have been married to my wife (35F) for 10 years now. We have 3 kids. My wife's sister (38F), we'll call her Debbie, has never been able to have children.\n\nShe's also a very problematic person. She's miserable, usually critical of my family, rarely has anything nice to say that isn't SUPER passive aggressive, I think you'll get the picture. She seems very jealous of my wife too.\n\nWe had a birthday party for my son last Saturday, he turned 6. Her dog's birthday also happened to fall on that day.\n\nWednesday of last week, Debbie sent a text to my wife and I, asking for us to buy her dog a few presents to open since she's bringing her dog to the party. We didn't want to do this, especially since we're already spending a lot of money for my son. She's clearly offended and said \"not even a couple fucking treats for like 10 dollars?\" She sent a few other vitriolic texts but we ignored her and hoped this would pass. We're used to this kind of attitude from her.\n\nAt my son's party, Debbie shows up with her dog as promised. She didn't bring any presents for my son (despite asking what he wanted). She was very irritable throughout the party. While my son is eating his birthday cake (after he opened his presents), she says to my son, in front of our family, \"I didn't get you a present because your parents are too cheap to buy presents for my kids.\" Referring to her dogs as her \"kids\" is somehow the least annoying thing about Debbie. After exchanging a few words with my wife and I, we decide to kick Debbie out of the house. Things have been silent since then, hopefully it'll stay that way for a while.",
            "ups": 44,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dfb9wp/aita_for_refusing_buy_birthday_presents_for_my/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1dfb9wp/aita_for_refusing_buy_birthday_presents_for_my/",
            "author_fullname": "t2_11sn0x4sv4"
        },
        {
            "title": "AITA for telling my family it was wrong to eat my cake?",
            "selftext": "I (18f) live with my dad(50m), mom(49f), and brother(10m). for context I spent hours making a cake for my Boyfriend(18m) as a present. It was the best cake I have ever made and i was extremely proud of it. when I made it i told my family to not eat it, and to ask me if they wanted some. i mentioned it multiple times and they all agreed and promised they wouldn’t. this was a very important cake to me and since it was technically my boyfriends i didn’t want them eating it without permission. \n\nwhen i gave my boyfriend the cake he loved it and it was a really nice moment. fast forward to today( a day later ) i was still telling them to not eat it. i had decided to go to my boyfriends house and hang out there today, i trusted my family to leave the cake alone as they new how much it meant to me and they told me they would leave it alone. me and my boyfriend had a good day but when i had gotten home i realized a whole chunk of the cake was gone. i got upset because the part they had eaten was the part with his name( that was the part i specifically saved for him ) \n\ni went to my brother and dad and i asked them if they had eaten it and my brother told me that he had LICKED the frosting of of part of it. so basically the cake part was just thrown away or someone else ate it. i got upset and said that he should have asked me, but my dad got defensive and said that it was my fault for keeping it here and if it was my boyfriends i should have taken it to his house. i said that i was just mad because i had told them specifically to ask me and they still didn’t listen. he started yelling at me and calling me rude and selfish and saying i was being over dramatic. i told him i wasn’t and that i was allowed to be upset, but then my mom yelled at me and was asking what was going on and when i told her she said it was stupid and i was being over dramatic and said i was choosing my boyfriend over my family.\n\ni feel like they should have understood why i was upset and not have eaten it without asking in the first place but i don’t know AITA?\n\nEdit: this is not a fake story and like i stated previously i had told them to at least ask me beforehand. i was not telling them that they cant have any i was telling them to ask me first because it was not their cake.",
            "ups": 812,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1deryrb/aita_for_telling_my_family_it_was_wrong_to_eat_my/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1deryrb/aita_for_telling_my_family_it_was_wrong_to_eat_my/",
            "author_fullname": "t2_i91tcddx"
        }
    ],
    [
        {
            "title": "AITA Monthly Open Forum June 2024: Assholes ASSemble!",
            "selftext": "#Keep things civil. Rules still apply.\n\nWe’ve been diving into various sub rules lately. So we thought we’d take a break this month, and revisit something we did in an earlier open forum. Hence, the call to ASSemble! (We had a few names that we were throwing around. ASS (Assholes Sharing Stories), Asshole Amnesty Month.\n\nTell us about a time when you were the asshole. We can relax *some* sub rules a bit (a revenge story is probably fine, since you’re recalling, and not asking for judgment). But, other sub rules still apply (no violent encounters, for example)! Let us know about a time when you knew you were the asshole. Maybe you didn’t mean to be, but after the encounter, you realized you were TA. Or, maybe you knew what you were doing, and went through with it anyway! \n\nPersonally, I've always felt the more low-stakes the issue, the better. Those are always my favorite AITA stories, but feel free to share whatever you may have. And most important - have fun with it! \n\n___\n\n#As always, do not directly link to posts/comments or post uncensored screenshots here. Any comments with links will be removed.\n\n---\n\nWe'd like to highlight the regional spinoffs we have linked on the sidebar! If you have any suggestions or additions to this, please let us know in the comments.",
            "ups": 66,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1d5g8i7/aita_monthly_open_forum_june_2024_assholes/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1d5g8i7/aita_monthly_open_forum_june_2024_assholes/",
            "author_fullname": "t2_2yspbtwq"
        },
        {
            "title": "AITA for walking out the room after my brother told me the name of his baby?",
            "selftext": "\nI am only a teenager but my mother had my brother at 16 making him in his 30’s. Ever since i was young I have always talked about naming my future daughter Scarlett, I don’t know why but I have always adored the name. Every time the topic of babies, names, and children comes up I always say that my daughter will be called Scarlett, everyone in my family knows this. Last week, my sister law gave birthday to a healthy baby girl, as you can probably guess, they named Scarlett. I was really upset at my brother as he knows that was my top name, I didn’t make a big deal about it I just left the room obviously upset, Scarlett isn’t a family name or anything and my brother has never mentioned liking the name, one time he said he wasn’t a fan. I asked him why he would name his daughter that and he told me to stop over reacting and get over it and that i don’t own the name. I get that It doesn’t belong to me but just because I am a teenager doesn’t mean\nthat I am not allowed to have plans for my future.\n\nEDIT: when i say walked out I didnt like storm out or anything i just excused myself. A lot of people are saying that its common for cousins to have to same name but not here and in my family. And. Scarlett isnt a common name here ❤️❤️\n\nSome people are confused, im a girl. And im not sixteen 😂❤️",
            "ups": 1778,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1df8rs0/aita_for_walking_out_the_room_after_my_brother/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1df8rs0/aita_for_walking_out_the_room_after_my_brother/",
            "author_fullname": "t2_12f870ip7y"
        },
        {
            "title": "AITA for not retaking the family photo since my DIL was not in it",
            "selftext": "Every couple of years we get everyone together and do family a giant family photo. In total it is about 40 people. \n\nOur last one was in 2018 and we decided to do this again. I organize the whole thing and everyone was told that small pictures will be done at 4 and the big picture was at five. Afterwards we get dinner.\n\nThe issue is that my son and DIL were running late. Wasn't a big deal since it was just small pictures. They get here in time for the large picture. I asked everyone to be there on time. I called twice asking if anyone is missing. Everyone is lined up and the photographer takes like 15 minutes of the big picture.\n\nEveryone is hungry and hurrying to get food. My DIL soon comes out asking about the picture. It is around 5:30 at this point. She told me that she was in the bathroom fixing her hair when the picture was being taken. She asked me to round everyone up again to get a picture\n\n\nI told her no, that she was late coming to the event and couldn't care enough to actually be on time for the picture. I am not gathering everyone up again and paying the photographer an extra hour ( he was done and packing up at this point)\n\nThis caused a huge argument between her and me. My son is demanding I get her in the picture and I told him to pay someone to photoshop her in\n\nAITA?",
            "ups": 1586,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1df7xke/aita_for_not_retaking_the_family_photo_since_my/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1df7xke/aita_for_not_retaking_the_family_photo_since_my/",
            "author_fullname": "t2_12f639c5kx"
        },
        {
            "title": "AITA for not inviting my picky eater Dil to my dinner event",
            "selftext": "I will be as clear as possible. I like to try new food and there is a chief I have been following for years. She open a restaurant near me a few years ago and it is almost impossible to get a spot. I was extremely lucky and got one. It is a fixed menu and you eat what you are served for the most part. The menu changes or rotates about every week.\nThey serve unique dishes.\n\nAnyways when I booked it I booked for only five people. I invited my sisters, my two daughters and me. I also decided to pay for it all since I have a good job and wanted to treat them. \n\nThis is we're the issue started, I have a DIL who is a picky eater. I didn't include her in the invites because I know she wouldn't eat it. I can't even be certain she would try dishes. She is the type of person that eat like 5 foods.\n\nEveryone runs in the same-ish  circle and I got a call asking  why she was not invited since she knows everyone that was invited. I tried to be polite by saying it was just a small gathering and move the conversation along.\n\nShe kept pushing and I told her it is because she is a picky eater. That I am not paying for someone to not like the food, or not even try it. She thinks I am very cruel for excluding her.",
            "ups": 2031,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1df476w/aita_for_not_inviting_my_picky_eater_dil_to_my/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1df476w/aita_for_not_inviting_my_picky_eater_dil_to_my/",
            "author_fullname": "t2_12ew1jes0a"
        },
        {
            "title": "AITA for telling my wife to please get the hell out of my way. ",
            "selftext": "I was raised to always be helpful and polite. I like to hold the door open for people, as an example. \n\nI always try to treat my wife with respect. She is a good person but even if she weren't I would. \n\nShe has been trying to be like me lately. And it's driving me nuts. \n\nShe cannot understand the Time Cop rule that two bits of matter cannot occupy the same space. \n\nShe will hold the door for me then stand in the way. When I hold the door for her I stand to the side so she can pass. She cannot seem to get this concept. \n\nI have had to start traveling for work and she drives me to the airport. I could Uber but she says she likes the drive. We always stop for breakfast on the way so it's a way for us to sneak in one more date before I'm gone for a while. \n\nSo I will have my backpack on and my rolling luggage in my hand. She will open the door go through and hold the storm door. But she will fully stand in the way.  \n\nI have explained the concept of standing to the side. I've asked her to please just go through and I will deal. I've tried leaving before her so I can deal. I've even tried just standing inches away as she holds the door and I cannot move forward. Nothing works. \n\nI was in a hurry yesterday because my flight was changed. We could still stop for breakfast but we didn't have much leeway. \n\nAnd she would not get out of the way. I lost my coolmand asked her to please get the hell out of the way because I needed to get to the car. \n\nShe is mad at me and has brought up my rudeness at both our calls since she dropped me off. \n\nI think that I have been very patient and she should have taken the hint before now. ",
            "ups": 3851,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1deyapp/aita_for_telling_my_wife_to_please_get_the_hell/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1deyapp/aita_for_telling_my_wife_to_please_get_the_hell/",
            "author_fullname": "t2_12egg4nqyp"
        },
        {
            "title": "AITA for telling my wife that I do not want to go to her parents house on Father’s Day?",
            "selftext": "Need to know if I am wrong. My wife asked me what I wanted to do for Father’s Day. I said take it easy, chill at home and hang out with the kids. She said ok but her sister asked her if we all wanted to get together to do a Father’s Day cook out for me and my father in law. This would mean me, my wife and two kids would go to her parents house for dinner/cookout along with my sister in law and her husband. I told her I don’t know that I just want to take it easy at the house. I then told her that she could go and I would just hang out with the kids. She said ok but then said the kids also should go to see her dad. I said really? Thinking to my self I get that she wants/needs to see her dad but why couldn’t the kids stay with me. Am I wrong for just wanting to hang out at home and with my kids on Father’s Day and not go to the in laws and keep the kids with me while my wife goes for a bit? ",
            "ups": 421,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dfbea1/aita_for_telling_my_wife_that_i_do_not_want_to_go/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1dfbea1/aita_for_telling_my_wife_that_i_do_not_want_to_go/",
            "author_fullname": "t2_xnll7"
        },
        {
            "title": "AITA for walking away from my pregnant wife on the beach?",
            "selftext": "So we parked the car at the beach which is about 100 metres away from the sea and started walking up. My wife is almost 7 months pregnant and is quite a slow walker. I pulled ahead about 15-20 metres to get a lay of the land and to see how busy it was etc. My wife claims when I pulled ahead I didn't turn back to check she hadn't fallen over once. \n\nI was not that far ahead, and I easily could have heard her if anything had happened. I think she is being unreasonable because it doesn't seem like a big deal. We have a very good relationship, we rarely fight but this seems to have really got under her skin.\n\nAITA? \n\nEdit: we're on holiday in a foreign country and it's significantly hotter than a temperature we're used to. I'm also 6ft4 and she's 5ft 1",
            "ups": 2732,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1devv9y/aita_for_walking_away_from_my_pregnant_wife_on/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1devv9y/aita_for_walking_away_from_my_pregnant_wife_on/",
            "author_fullname": "t2_5z1k93tb"
        },
        {
            "title": "AITA for calling the police on my GFS daughter?",
            "selftext": "So I'm 42 gf is 50 and she has a 25 year old daughter that has a key to our house. Her daughter likes to take things from our house without permission, stealing as everyone else calls it. Mainly it's been tools from my tool box, new Tupperware we had just bought, she said hers was old and stained so she threw hers out and took ours without asking or telling us. Recently we bought a nice computer desk and noticed a beat up flimsy one in it's place about 2 months later. Her daughter said she replaced it with her old one because ours was better than hers. GF refuses to put her in her place because when she does the daughter threatens to not let my gf see her grandson. Clearly the daughter is escalating in what she steals and my concern is how long before my Metallica autographs walk out the door with my guns and guitars.  In my frustration I put up a camera in secret and caught her taking items from the garage and house. I went to the police and showed them the footage, we went to her apartment, I confronted her and gave her two choices; return the items or I press charges. She returned them and now is telling her mom to leave me. AITA?  ",
            "ups": 1361,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dexv0i/aita_for_calling_the_police_on_my_gfs_daughter/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1dexv0i/aita_for_calling_the_police_on_my_gfs_daughter/",
            "author_fullname": "t2_joa65z23"
        },
        {
            "title": "AITA for giving my sister a wedding cake made by one of my assistants instead of making her one myself. ",
            "selftext": "My grandmother made wedding cakes for everyone I knew growing up. I learned how to do everything from her. I would make roses out of playdough while she made them from fondant. My sister was never interested. I have turned my memories of my grandmother into a business. \n\nI make wedding cakes. And I charge a fair bit for them. As an example my base price is $8 a slice. So if you have 100 guests you will be buying an $800 cake. One of my base models. In return you will get a delicious cake with piped decorations. \n\nAt $17.50 a slice you get my top notch work. Hand molded flowers and the whole deal. Yes I know it is expensive. Nobody is forced to buy one of my cakes. There are many very good bakers in my city. \n\nMy sister is getting married. It is kind of a last minute thing. She came with my mom to talk to me about making her wedding cake like two weeks ago. Very last minute. I said there was no way as I had other clients that were ahead of her. My mom got mean and said that I had to do this. After a while I relented. I love my sister even though she is an impulsive pain in the ass. \n\nI said I could do it for about $1,000 for what she wanted. That is much less than I would charge anyone else. There is no profit in that at all. She wanted a very elaborate cake with a lot of decoration. \n\nOH HELL NO IT'S GOING TO BE A GIFT. \n\nI do not give gifts that expensive. I am not rich. I will have to eat the material costs and the wages for my helpers as is. \n\nI did not want to argue any more so I said that I would make her a basic cake. Still very nice. I did not budge. I do not negotiate about losing money. \n\nI actually though about outsourcing to a really great Filipino baker I know that could do it cheap. It would cost me $300 and I could concentrate on my clients. \n\nI ended up just letting one of my apprentices do the cake. It was for my sister so I double checked everything. And I did the decorations on the top tier. The one the couple saves to have on their anniversary. \n\nThe cake was a hit and many pictures were taken. I told them NOT to mention that I did the cake. It was not really up to par. They did not listen. I had a client that knew my sister. She asked and I was honest. My sister found out she got a cake make by my helper. It has caused a huge fight. \n\nI think it would have been better if they had just gone elsewhere. They are pissed that I did not spend days sculpting the cake just for them. \n\nAITA?",
            "ups": 4024,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1deqop3/aita_for_giving_my_sister_a_wedding_cake_made_by/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1deqop3/aita_for_giving_my_sister_a_wedding_cake_made_by/",
            "author_fullname": "t2_12dd19witc"
        },
        {
            "title": "AITA… for not splitting my friend’s train tickets home after getting different flights due to missing our original flights home?",
            "selftext": "AITA… for not splitting my friend’s train tickets home after getting different flights due to missing our original flights home?\n\nContext - all 26F. We have just been on holiday and missed our flight home due to oversleeping. We woke up and I was panicking as I had work the next day so was looking at flights. I had originally found a cheaper option which would mean us getting a cheap coach to another airport meaning that we get the cheaper flight to a different city in our country, and that my partner would pick us up and drop us home. \n\nThey didn’t want to get the coach even though it would’ve worked out cheaper for all of us, so I had to make a decision and found one seat on a direct flight home which would get me in earlier. This was okayed by two of them but one of my other friends said it was selfish. I booked the flight and then helped them find an alternative flight for the three of them. Splitting any of the costs wasn’t discussed or agreed at this point. \n\nI left for the airport and then got a message from one of them asking if I would be cool to split the costs of all the flights together. At first I wasn’t sure but had a think about it and decided it was fair as they got more expensive flights. My flight was delayed by 9 hours and they ultimately got home before me. They had to fly to a different city and get train tickets home for a 3 hour train. \n\nThe next day I sent over the calculations of what I would have to send each of them but they weren’t happy as I hadn’t included their train tickets, but they would’ve had to buy transport home regardless of if we made our original flight (albeit the new train tickets they bought were more expensive). This wasn’t a cost agreed and now there is back and forth about what I should pay as they spent more on getting home. \n\nI didn’t choose the earlier flight due to cost, just to get home for my responsibilities as I had work the next day whilst they had an extra day off. Now I feel villainised for doing so, although they were okay with it at the time of me booking my flight. I feel like I’ve been more than fair in splitting the flights but the train was a surprise cost put on me. Before the holiday I hosted them the night before and my partner gave us a lift to the airport which saved us about £50-£60 in airport transfers and he also paid for the drop off cost. \n\nAm I the asshole for disagreeing with this? I struggle to set boundaries sometimes and feel a bit bullied into this. I feel like they have fallen out with me over this, which seems pointless as we have had a lovely holiday. Has anyone got any advice with this? I want to say no but I am struggling with advocating for myself here. ",
            "ups": 410,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1df2v86/aita_for_not_splitting_my_friends_train_tickets/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1df2v86/aita_for_not_splitting_my_friends_train_tickets/",
            "author_fullname": "t2_cq2ii9p7"
        },
        {
            "title": "AITA for yelling at my sister after she leaked private videos of my room???",
            "selftext": "I (19F) live with my parents, my younger sister (16F), and our four dogs. Recently my sister sent private videos of my room that she took when I was at my lowest point mentally to her friend. This friend then sent the videos to all of our friends. For everyone we knew to see. My boyfriend (22M), and several of our friends saw it before they finally took it down because my mother told them to. My sister’s friend said he did it because I “needed to learn my place”, and that “no one was going to give me any sympathy” because I “didn’t deserve it”. I screamed at my sister and her friend, and called them out for invading my privacy, and humiliating me purposely. I blocked my sister’s friend and unadded them on everything. I still haven’t really talked to my sister. My mother then said that I had done it to myself and I should have kept it clean, though she knows that I was not at all mentally stable/well at the time those videos were taken.  AITA?",
            "ups": 493,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1df0myb/aita_for_yelling_at_my_sister_after_she_leaked/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1df0myb/aita_for_yelling_at_my_sister_after_she_leaked/",
            "author_fullname": "t2_119njezway"
        },
        {
            "title": "AITA for telling my SIL to stop treating me like a kid?",
            "selftext": "Ok, so I, 19M, have an older brother 25M, Olly, who is married to Molly, 28F, they married when I was 16, and everytime Molly comes over when I am present she goes out of her way to baby me even more than my parents do. She calls me Olly's 'cute little baby brother', pinches my cheeks, and gives me sucky lollipops, like the ones you get from Sainsbury's, and always asks me to eat them in front of her, even though they're kinda gross. \n\nI'm 19 fucking years old and she's acting like some old auntie with a child. I feel bad, because she's a really nice person and she does probably see me as a little brother of some kind since she's always getting me stuff and giving me compliments, telling me how much I look like Olly. \n\nThis all came to a head earlier today, when Molly gave me one of those suckers, and I said thank you and put it in my pocket. She told me she wanted to see me have it, as I was a 'growing boy' and she was worried about me. This is where I may have been TA, because I snapped at her that I wasn't a 'growing boy', I was grown fucking adult and I'd appreciate it if she stopped treating me like a kid.\n\nShe got really upset, and told me she didn't expect me to be so rude and impolite.  She went back over to Olly, and I went back to my room and I'm feeling really guilty now. I didn't mean to upset her, but I just don't want to be treated like a bloody toddler anymore.",
            "ups": 494,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dezp8e/aita_for_telling_my_sil_to_stop_treating_me_like/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1dezp8e/aita_for_telling_my_sil_to_stop_treating_me_like/",
            "author_fullname": "t2_12ehmczbcb"
        },
        {
            "title": "AITAH For Flying a Flag?",
            "selftext": "I (24F) am a Finnish-American who loves both countries. I recently moved to a neighborhood with a lot of older gentlemen. My new house has a flagpole with 2 flying flag hooks, and I  saw this as a great opportunity to appreciate my home and my new country. So I put an American Flag on the top hook (because flag code says the American flag should be higher than other flags) and a Finland Flag below it. Today my neighbor (88M and his friend 87M) came and knocked on my door and asked me to take my Finnish flag down. When I asked why, they said (and I quote) “Flyin’ two flags is a real illegal thing to do. We fought in ‘Nam to give the ‘Merican flag the right to fly, not a communist country” They meant “illegal” as in immigrant, which I am, but I have papers and came legally. (Also Finland is not communist). They came back a second time after I respectfully asked them to leave and they had a lockcutter looking contraption and threatened to cut my Finland flag down. I feel a bit bad that I’m making them this upset. They said my flag is triggering their PTSD (I have no ideas how, as Finland was on America’s side through Vietnam). Am I the AH? ",
            "ups": 127,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1df9uec/aitah_for_flying_a_flag/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1df9uec/aitah_for_flying_a_flag/",
            "author_fullname": "t2_127hi26gqp"
        },
        {
            "title": "AITA for not giving my neighbors soccer ball back, after he threw it onto my 3rd floor apartment balcony, which he kicks against the side of the apartment all day?",
            "selftext": "A little context. I live on the 3rd floor of an apartment building and the family below me has a little boy who loves to kick his soccer ball around ALL DAY. He kicks it against the side of the building, against the inside walls of his apartment, slams it into the ceiling (my floor), and throws it onto the roof. This isn't just loud; it shakes my entire apartment. I work a night shift, and this makes it impossible for me to sleep. \n\nBy chance, he kicked his soccer ball onto my balcony, and I just haven't given it back. It's been two days, and he has been knocking on my door continuously for those two days. He knocked (beat) on my door for two hours straight today, and at least once every hour after that. The thing is, I can sleep through someone knocking on my door, I can't sleep through my apartment shaking. I was finally able to sleep a full 8 hours today and I really don't want that to go away. AITA?",
            "ups": 2297,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1deqq0u/aita_for_not_giving_my_neighbors_soccer_ball_back/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1deqq0u/aita_for_not_giving_my_neighbors_soccer_ball_back/",
            "author_fullname": "t2_nb46k2clp"
        },
        {
            "title": "AITA for how I reacted to my wedding pictures?",
            "selftext": "I got married (22f) to my husband (24m) a few weeks ago. The wedding overall went great even though there were a few minor hiccups. We hired a professional photographer who stated in his contract that we couldn't hire another photographer besides him. If we wanted a second photographer, we had to hire one of his assistants or coworkers. This is pretty typical in the wedding industry.\n\nMy aunt surprised us at the wedding by doing photography as a gift to us. This was very surprising and she didn't tell anyone besides her husband. She's a real estate photographer, so she has a fancy camera and occasionally takes pictures of people. Our photographer was PISSED. He pulled me aside and asked what was going on and I had to explain the whole situation, which made me extremely stressed. While taking pictures, my aunt would pull people aside when they needed to be with the professional photographer for group photos. It turned into a chaotic mess, but we wanted to be kind and were SO stressed and had no time to tell her to stop.\n\nWe got the photos back from her last night. The photos of me were rough. They're taken from a low angle so I have a double chin, my mouth is open in 1/3 of the shots (talking, eating, etc). There's zoom ins of my face and my eyes are closed. They're pretty much all candid's. You can see how stressed out I am in my facial expressions, because behind the scenes the real photographer was shouting at us to hurry up.\n\nIn comparison, the photos of my friends taken by her were all staged by her and look gorgeous. People are smiling , posed, and beautiful. I began sobbing seeing them. I showed the photos to a few of my friends and they very kindly told me that they were unflattering pictures of me.\n\nMy family received the photos and plans on putting them up in their house because they're from my aunt. I asked them to wait because we will have professional photos soon, but they don't want to wait for those. I'm insecure about my appearance and I've been sent photos of me squinting or with my eyes closed with a double chin calling me beautiful and I just know that's not the case based on my non family member's reactions.\n\nMy husband said these features are normal in humans and that he didn't like his hair in the pictures and to just get used to it. I cried off and on when looking at them and told him it was different because he's smiling, his eyes are open in the photos. He got angry and said the point of a wedding is to celebrate our love and that the photos don't matter. He told me to just stop looking at them if it's going to make me cry and I just didn't say anything after that.  I wish he was more empathetic, but he thinks I'm being self centered and remained upset at me for crying for the rest of the night.\n\n  \nEdit: We had already started taking professional photos when she showed up and began grabbing people for pictures. We didn't fully realize what was going on until she began grabbing people away. We thought she was just taking photos of her own kids. After she began taking pictures of everyone and grabbing people, she told us it was our gift and the photographer asked what was up and we told him and he saw how upset we were so he didn't' leave. We had 30 minutes until the ceremony and we didn't want to start an argument with her when we were stressed enough.\n\n\n\nAITA",
            "ups": 165,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1df6926/aita_for_how_i_reacted_to_my_wedding_pictures/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1df6926/aita_for_how_i_reacted_to_my_wedding_pictures/",
            "author_fullname": "t2_6axzflgz6"
        },
        {
            "title": "AITA for refusing to accept my mom’s friend’s MacBook after her autistic son broke mine and asking her to buy me a new one?",
            "selftext": "I (16F) got a brand new MacBook Pro for my birthday last month. My family isn’t rich and I don’t usually get gifts like that. My parents said they got me that because I’ve been doing great at school and they thought I deserved something nice after using an old Chromebook for years. \n\nA few days ago, my mom’s friend came over with her kids (14F and 10M). We were in my room and me and the girl were sitting on my bed talking while the boy was on the floor playing with some Legos (he is autistic). He walked over to my desk, opened my laptop, and told me to give him the password so he could play Roblox. I told him he can’t play on my computer and he started crying and saying it’s not fair and he’s bored. I told him to go get his mom’s phone if he’s bored and he said he wants to play on my laptop. When I said no again, he threw it on the floor and stomped on it.\n\nI went outside and told my mom. His mom apologized and said she would pay for the repairs. I told her that I don’t think it’s repairable because it’s completely smashed. He threw it open with the screen facing down. The thing that connects the screen to the keyboard snapped, the screen was filled with cracks, and it was dented all over. We took it to a repair shop and they told us that it can’t be fixed and we should just buy a new one instead.\n\nMy mom called her friend and told her that. She came over with her MacBook and said I could have that instead. I told her that I don’t want her 5 year old MacBook Air, I want her to give me $1800. My mom is on my side and she is going to give us the money, but she’s not happy about it. She said she was planning to buy her daughter a laptop because she’s going to high school and her son a PS5 for his birthday and she won’t be able to do that because I was greedy. I don’t care that her brat isn’t getting a PS5 but I kinda feel bad for her daughter because this wasn’t her fault. She’s been telling all of her and my mom’s other friends that I’m a spoiled brat and this wouldn’t  have happened if I’d let her precious baby boy play Roblox or given him my phone. He also didn’t really understand what he’s doing because he’s autistic.",
            "ups": 61,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dfcvs2/aita_for_refusing_to_accept_my_moms_friends/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1dfcvs2/aita_for_refusing_to_accept_my_moms_friends/",
            "author_fullname": "t2_12898co3kx"
        },
        {
            "title": "AITA for calling the police because my neighbors were being loud?",
            "selftext": "I live in an apartment complex with about ten 10-12 story buildings. I live on the third floor. \n\nThree days ago, drunk men were really loud outside of my building. They were singing and yelling. It was almost 2 am.\n\nI am 21 years old, work full time, and study full time. It's exam season currently, so I was really irritated that they woke me up, and I was also irritated that they weren’t shutting up.\n\nI could hear my other neighbors asking them to keep quiet, but they weren't shutting up, so I called the police. \n\nThe police came, and I guess things escalated because they arrested one man.\n\nThe next day, I could see Facebook posts in the neighborhood group, and surprisingly, the rude and mad comments were directed at a person who had called the police (me lol).\n\nI figured out that it was someone’s birthday.\n\njust so you have a better understanding, I’m translating one post from that group: \n\n“when the dogs are barking and howling all night long, you don’t seem to be bothered and you are mad over sounds of fun and happiness? people are so unfair, May God bless you with many loud birthdays George!”\n\n\nToday, a woman came to my door, visibly upset (I could see her through the peephole). I didn’t open the door. She somehow figured out who called the police, and I figured she's the wife of the man who got arrested. She was calling me names and saying that I wouldn’t be at home forever, and I'll get my share of fairness. Kinda sounds like a threat if you ask me.\n\nAm I the asshole for calling the police?\n\nShould I apologize?\n\n\np.s. \nsorry for my english, it’s not my first language.\n\n",
            "ups": 549,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dewj0f/aita_for_calling_the_police_because_my_neighbors/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1dewj0f/aita_for_calling_the_police_because_my_neighbors/",
            "author_fullname": "t2_11x9fyywq4"
        },
        {
            "title": "AITA for following through with my late wife’s wishes?",
            "selftext": "I (49M) was married to my wife for 20 years. I lost her in a car accident 8 years ago. We had two beautiful daughters together, Maeve (18 now, 10 when her mother passed) and Alex (16 now, 8 when her mother passed). \n\nI am very close with my daughters but they were both definitely mama’s girls. My wife was a magnetic woman. She was beautiful, intelligent, kind, and people were drawn to her. \n\nAn important thing to know about my wife is that she had a passion for writing. She was unfortunately in a profession where she didn’t write much so, she did a lot on her own time. One of her favorite things to write was letters. She wanted people to know that she cared about them. \n\nAfter she had each of my daughters, she wrote them a letter. She wrote each within days after their births and wanted to give them away on their graduation days. She put them in the fire box in our basement to avoid losing or forgetting about them. She wrote the letters with the intention of giving them to our daughters herself 18 years later as a sort of time capsule type of thing. Both letters contained mostly words of wisdom and information about what was going on when they were born. \n\nMaeve graduated from high school today and I went to her room with the letter tonight. I let her cry on my shoulder as she read it and at first she seemed happy to have her something directly from her mother. However after she read it she turned to me looking surprisingly angry. She asked why I had waited so long to give it to her. She had so many rough moments and heartbreak in the last 8 years where all she wanted was her mother’s wisdom and I withheld the letter. \n\nI told her that I was just doing what her mother had said she wanted and Maeve shot back that her mother also hadn’t planned on being in the accident. Alex heard the shouting and came into the room and Maeve told her about the letter. \n\nNow they’re both upset and don’t want to talk to me. I feel so awful about this whole situation. I was raised by my single mother after my own dad took off so on one hand, I’ve always wanted to be the best father I can and I feel terrible that I withheld something that would’ve brought them comfort. On the other hand, my wife had very specific instructions about her intentions with the letters and I just wanted to follow through with that. So now I’m very conflicted and I just want to know, AITA?",
            "ups": 10512,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1degchk/aita_for_following_through_with_my_late_wifes/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1degchk/aita_for_following_through_with_my_late_wifes/",
            "author_fullname": "t2_x3iucudl6"
        },
        {
            "title": "WIBTA if I name my own baby?",
            "selftext": "I,(22 F) am currently 9 months pregnant with my first child. My mother (42 F) has been extremely supportive throughout my pregnancy in terms of buying the baby stuff and making sure we are ready for once the baby arrives. The father of my child (25 M) hasn't been there as much as I would have appreciated him to be and when I voiced this out he broke up with me after a 3 year relationship, however he and I are on good terms currently as friends and I have no intention of getting back with him. His mother (54 F) and I were once close then stopped being close because her two daughters don't like me, one felt I was \"replacing her\" and the other chose to side with her sister which is the right decision, the older sister asked to speak to me but I believe had there not been a baby there would not be a conversation so the distance between us works just fine to maintain the peace we both have.\n\n The male's mother has also been supportive for the last few months although she has made some comments that I don't like such as \"she doesn't look a month pregnant\" after her son told her in a family meeting he had with his mother and sisters (might I add I am a university student so the relationship is long distance) other comments have been on how I dress. \n\nI am writing all this so you understand everyone's place in my life my ex wants to give the baby a name, his mother wants to give the baby a name and my mother wants to give the baby a name. I don't like all names I have resulted in standing back and alllowing myself to not giving my child a name because at first I felt I will write all names chosen on the birth certificate. \n\nRecently there's been a problem of what will the baby's first name be. I am thinking of naming my child something completely different and sticking to it. WIBTA?",
            "ups": 310,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dezeds/wibta_if_i_name_my_own_baby/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1dezeds/wibta_if_i_name_my_own_baby/",
            "author_fullname": "t2_qcc6b6e5d"
        },
        {
            "title": "AITA for telling my dad, if he wants me to get married, and have kids then he can pay for it?",
            "selftext": "I (26m), single, live in a small mobile home community. I've been told numerous times by my dad to get a gf, marry, and have kids. Me personally dont really want any of that as i will never be able to afford. I've lied to my dad saying that i 'might'. After a few times of saying i 'might', he told me that i need to do this for the family name, i finially snapped and told him that \"If this is so damn important to him you then you pull your checkbook out a pay for it.\" That pissed him off, until i rubbed it in further and said, \"I dont give an f about our family name, we're not rich millionaires, i can barely afford to get a gf in the first place.\" I finally told him that i'd rather go out with friends, find new hobbies, work hard on my career, and in the future, travel places i dream of going to. So AITA for not doing what my father wants?",
            "ups": 89,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1df8tzw/aita_for_telling_my_dad_if_he_wants_me_to_get/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1df8tzw/aita_for_telling_my_dad_if_he_wants_me_to_get/",
            "author_fullname": "t2_pgo771bq"
        },
        {
            "title": "AITA for giving a white child a trip to camp in my mainly Indigenous organization? ",
            "selftext": "I (27f) am a social worker at a homeless shelter. Our shelter serves mostly Indigenous families but our doors are open to everyone. I am the case manager for the children’s files. \n\nI recently applied for a partnership with a children’s museum in our town where we could send our children in the shelter to their summer camp for free, and we were approved. Problem was we were given only one scholarship for the camp, and we had five children who qualified. I had applied under the impression we could send more than one. My clients who qualified were two sets of brothers, both sets indigenous, and one only child, who is Caucasian. I felt the most fair option was to give the only child the scholarship because I didn’t feel it would be fair to give one brother a scholarship and not the others. I ran this past my colleagues who were on shift at the time and they agreed. The child who got the scholarship was absolutely thrilled. I’m currently looking for other opportunities for the other kids and have gotten them several day passes to different rec centers (ie trampoline park, zoo. Etc). \n\nThis was three days ago and we’ve since had another rotation of staff come on and they are FURIOUS with me over the child I chose for the scholarship. I am being called racist and that I am making our Indigenous agency look bad for favouring the white child. One colleague is trying to call the museum to get the scholarship transferred. \n\nNowhere in the application, nor our guidelines, say we need to give Indigenous children priority. I genuinely was not thinking about race, I was thinking about what would cause less conflict. I did not want to have to choose between siblings, so I chose a child who didn’t have one. \n\nAITA? \n\n*edited to add because it’s probably important to mention, the other kids will be going to camp too- we have multiple opportunities and partnerships but this one specifically we only got one spot*",
            "ups": 60,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dfayhx/aita_for_giving_a_white_child_a_trip_to_camp_in/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1dfayhx/aita_for_giving_a_white_child_a_trip_to_camp_in/",
            "author_fullname": "t2_ufbrmf5z"
        },
        {
            "title": "AITA for refusing buy birthday presents for my SIL's dog?",
            "selftext": "I (35M) have been married to my wife (35F) for 10 years now. We have 3 kids. My wife's sister (38F), we'll call her Debbie, has never been able to have children.\n\nShe's also a very problematic person. She's miserable, usually critical of my family, rarely has anything nice to say that isn't SUPER passive aggressive, I think you'll get the picture. She seems very jealous of my wife too.\n\nWe had a birthday party for my son last Saturday, he turned 6. Her dog's birthday also happened to fall on that day.\n\nWednesday of last week, Debbie sent a text to my wife and I, asking for us to buy her dog a few presents to open since she's bringing her dog to the party. We didn't want to do this, especially since we're already spending a lot of money for my son. She's clearly offended and said \"not even a couple fucking treats for like 10 dollars?\" She sent a few other vitriolic texts but we ignored her and hoped this would pass. We're used to this kind of attitude from her.\n\nAt my son's party, Debbie shows up with her dog as promised. She didn't bring any presents for my son (despite asking what he wanted). She was very irritable throughout the party. While my son is eating his birthday cake (after he opened his presents), she says to my son, in front of our family, \"I didn't get you a present because your parents are too cheap to buy presents for my kids.\" Referring to her dogs as her \"kids\" is somehow the least annoying thing about Debbie. After exchanging a few words with my wife and I, we decide to kick Debbie out of the house. Things have been silent since then, hopefully it'll stay that way for a while.",
            "ups": 52,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dfb9wp/aita_for_refusing_buy_birthday_presents_for_my/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1dfb9wp/aita_for_refusing_buy_birthday_presents_for_my/",
            "author_fullname": "t2_11sn0x4sv4"
        },
        {
            "title": "WIBTA for reporting my friend’s family business?",
            "selftext": "My friend comes from a relatively affluent family, his parents operate a small business that’s very successful. I don’t know their numbers, but it’s enough to fund a $2 million house and giving their son a $3,000/month allowance + $90,000 sports car. \n\nI never really knew how their business worked or how they were able to afford such luxurious lifestyle despite being in a very competitive and low margin industry. Well my friend spilled the beans and it’s tax evasion + breaking labour laws. They don’t report majority of their cash transactions and keep the sales tax they hold and they also exclusively hire undocumented immigrants who have little to no leverage. Minimum wage in our area is $15/hour, they’re paying their workers $7/hour. They also don’t get overtime pay or benefits. \n\nIt just rubs me the wrong way that his family was literally living such an excessive and wasteful life style while they exploited immigrants and pay less tax than me. \n\nI’m thinking about recording our next conversation and hopefully getting his dad caught red handed as well and sending it to the tax and labour department. \n",
            "ups": 133,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1df3nrm/wibta_for_reporting_my_friends_family_business/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1df3nrm/wibta_for_reporting_my_friends_family_business/",
            "author_fullname": "t2_12eudczc4r"
        },
        {
            "title": "AITA for changing my passwords  so my sister can't use any of the apps for work? ",
            "selftext": "I (30 F) have a sister (29) that has been a spoiled child since she was born. Not only my parents, but everybody would overprotect and give her anything she demanded,  claiming that she was the sweetest. On the other hand, i've always been rebellious and independent. This resulted in me working since i was 16, and currently owning my own successful business, while she has not worked a day in her life until a few months ago.\n\nSince i make a pretty good amount of money, i shower them both, my mom and my sister, with gifts everytime i can. Cellphones, brand clothing... anything, and it is never the other way around.\n\nI decided not to help my mom with anymore money until my sister  began to do the same, because she's been avoiding that responsibility saying she is depressed or anxious.  \n\nShe recently got a job as a personal assistant, where she required  to know some stuff to get the job done. She also needed a computer and she needed some specific apps. \n\nI pay a monthly fee for those apps, so i shared my password with her, taought her how to use them, and lend her some money to get a laptop. I've been helping with anything she needs.\n\nBut today, she decided to go back to her old self. Demanding help and miss treating me afterwards. I decided to give back the same attitude and we ended up having a big fight. I decided to change my passwords, not allowing her to work anymore on what she was doing. I know she can't afford them, and now i have her, my mother and a couple of relatives calling me the ah. They are demanding me to apologize and give the new passwords.\n\nI'm so done with her being a 29yo spoiled kid. If itah, then so be it.\n",
            "ups": 58,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dfaiw7/aita_for_changing_my_passwords_so_my_sister_cant/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1dfaiw7/aita_for_changing_my_passwords_so_my_sister_cant/",
            "author_fullname": "t2_11qcwce9ls"
        },
        {
            "title": "AITA for leaving my friends house after she made me wait me outside for 20 minutes?",
            "selftext": "Me and my friends usually do get togethers at my friends house since she is the one with the nicest patio/backyard. Two weeks ago we arranged our usual get together and planned on playing board games (nothing too crazy), she told us to come at 7 but since I do not drive and depend on my mom to take me everywhere I was a little late (15min aprox) and forgot to let her know, when I got there I sent her a message letting her know I was there to which she replied \"give me 10 min\", nothing weird since she has done that before when she's not ready yet. After 15 min aprox I texted her again asking if she could open the door since it was getting windy to which she replies \"No, you made me wait 15 minutes so now I'll make you wait 20\" I was PERPLEXED, she had never ever done anything like this before and mind you in our culture it's pretty common to arrive a little bit later that the accorded hour (15-20min), by the time she opened the door my other friend was already there waiting for her and she did not make her wait outside like she did with me, I said jokingly since that is how we talk to each other \"How unpunctual\" to which she replied \"Tone it down, Im not in the mood\" this was the final straw for me so I told her I was leaving, took an uber home and have not talked to her since, so am I the asshole for leaving and getting mad?\n\nUPDATE \nThank you everyone! Me and my friend talked in person about this whole situation, while she seemed mad about my behaviour she also accepted that she was in the wrong and definitely not in the mood that evening, I also apologized for being late and promised to do better since I know it can be frustrating for others. Hopefully this never happens again! ",
            "ups": 1124,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1deqyg3/aita_for_leaving_my_friends_house_after_she_made/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1deqyg3/aita_for_leaving_my_friends_house_after_she_made/",
            "author_fullname": "t2_knxzguone"
        },
        {
            "title": "AITA for telling my family it was wrong to eat my cake?",
            "selftext": "I (18f) live with my dad(50m), mom(49f), and brother(10m). for context I spent hours making a cake for my Boyfriend(18m) as a present. It was the best cake I have ever made and i was extremely proud of it. when I made it i told my family to not eat it, and to ask me if they wanted some. i mentioned it multiple times and they all agreed and promised they wouldn’t. this was a very important cake to me and since it was technically my boyfriends i didn’t want them eating it without permission. \n\nwhen i gave my boyfriend the cake he loved it and it was a really nice moment. fast forward to today( a day later ) i was still telling them to not eat it. i had decided to go to my boyfriends house and hang out there today, i trusted my family to leave the cake alone as they new how much it meant to me and they told me they would leave it alone. me and my boyfriend had a good day but when i had gotten home i realized a whole chunk of the cake was gone. i got upset because the part they had eaten was the part with his name( that was the part i specifically saved for him ) \n\ni went to my brother and dad and i asked them if they had eaten it and my brother told me that he had LICKED the frosting of of part of it. so basically the cake part was just thrown away or someone else ate it. i got upset and said that he should have asked me, but my dad got defensive and said that it was my fault for keeping it here and if it was my boyfriends i should have taken it to his house. i said that i was just mad because i had told them specifically to ask me and they still didn’t listen. he started yelling at me and calling me rude and selfish and saying i was being over dramatic. i told him i wasn’t and that i was allowed to be upset, but then my mom yelled at me and was asking what was going on and when i told her she said it was stupid and i was being over dramatic and said i was choosing my boyfriend over my family.\n\ni feel like they should have understood why i was upset and not have eaten it without asking in the first place but i don’t know AITA?\n\nEdit: this is not a fake story and like i stated previously i had told them to at least ask me beforehand. i was not telling them that they cant have any i was telling them to ask me first because it was not their cake.",
            "ups": 813,
            "url": "https://www.reddit.com/r/AmItheAsshole/comments/1deryrb/aita_for_telling_my_family_it_was_wrong_to_eat_my/",
            "over_18": false,
            "permalink": "/r/AmItheAsshole/comments/1deryrb/aita_for_telling_my_family_it_was_wrong_to_eat_my/",
            "author_fullname": "t2_i91tcddx"
        }
    ]
]

